# Grouping without using `groupby`

Groupby consists:

1. Split
2. Apply
3. Combine

In [1]:
import pandas as pd

In [2]:
city_temp = {'City' : ['Anaheim', 'Baltimore', 'Clearwater',
                       'Anaheim', 'Baltimore', 'Clearwater'],
             'Temp (C)' : [31, 21, 26, 30, 22, 27]}

df_city_temp = pd.DataFrame(city_temp)

df_city_temp

         City  Temp (C)
0     Anaheim        31
1   Baltimore        21
2  Clearwater        26
3     Anaheim        30
4   Baltimore        22
5  Clearwater        27

## 1. Split

Split the data into different groups by criteria (city)

In [7]:
# Anaheim
df_anaheim = df_city_temp[df_city_temp['City'] == 'Anaheim']

df_anaheim

      City  Temp (C)
0  Anaheim        31
3  Anaheim        30

In [11]:
df_baltimore = df_city_temp[df_city_temp['City'] == 'Baltimore']

df_baltimore

        City  Temp (C)
1  Baltimore        21
4  Baltimore        22

In [15]:
df_clearwater = df_city_temp[df_city_temp['City'] == 'Clearwater']

df_clearwater

         City  Temp (C)
2  Clearwater        26
5  Clearwater        27

## 2. Apply

Perform calculation for each group

In [19]:
anaheim_avg = df_anaheim['Temp (C)'].mean()

anaheim_avg

30.5

In [21]:
baltimore_avg = df_baltimore['Temp (C)'].mean()

baltimore_avg

21.5

In [22]:
clearwater_avg = df_clearwater['Temp (C)'].mean()

clearwater_avg

26.5

## 3. Combine

Combine the values based on group (city)

In [23]:
city_temp_combined = pd.DataFrame({
    'City' : ['Anaheim', 'Baltimore', 'Clearwater'],
    'Temp (C)' : [anaheim_avg, baltimore_avg, clearwater_avg] 
})

In [24]:
city_temp_combined

         City  Temp (C)
0     Anaheim      30.5
1   Baltimore      21.5
2  Clearwater      26.5

## 4. Complete grouping using `groupby`

In [26]:
# method 1
df_city_temp.groupby('City')['Temp (C)'].mean()

City
Anaheim       30.5
Baltimore     21.5
Clearwater    26.5
Name: Temp (C), dtype: float64

In [27]:
# method 2
df_city_temp['Temp (C)'].groupby(df_city_temp['City']).mean()

City
Anaheim       30.5
Baltimore     21.5
Clearwater    26.5
Name: Temp (C), dtype: float64